Repository: nkozdemir/fakestore-backend
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: tr

source: Validation failed
tr: Doğrulama başarısız

source: Authentication required
tr: Kimlik doğrulaması gerekli

source: You do not have permission to perform this action
tr: Bu işlemi yapma izniniz yok

source: Resource not found
tr: Kaynak bulunamadı

source: Method not allowed
tr: İzin verilmeyen yöntem

source: Resource conflict
tr: Kaynak çakışması

source: Unsupported media type
tr: Desteklenmeyen ortam türü

source: Unprocessable entity
tr: İşlenemeyen içerik

source: Request was throttled
tr: İstek sınırlandırıldı

source: Something went wrong
tr: Bir şeyler yanlış gitti

source: Service temporarily unavailable
tr: Hizmet geçici olarak kullanılamıyor

source: You do not have permission to view ratings for other users
tr: Diğer kullanıcıların puanlarını görüntüleme izniniz yok

source: You do not have permission to rate on behalf of other users
tr: Başka kullanıcılar adına puan verme izniniz yok

source: You do not have permission to manage ratings for other users
tr: Diğer kullanıcıların puanlarını yönetme izniniz yok

source: Unsupported language code '%(value)s'. Allowed: %(allowed)s
tr: Desteklenmeyen dil kodu '%(value)s'. İzin verilenler: %(allowed)s

source: Provide at least a title or description for each translation entry.
tr: Her çeviri girdisi için en az bir başlık veya açıklama belirtin.

source: Product not found
tr: Ürün bulunamadı

source: Category not found
tr: Kategori bulunamadı

source: Cart not found
tr: Sepet bulunamadı

source: User not found
tr: Kullanıcı bulunamadı

source: Address not found
tr: Adres bulunamadı

source: Invalid input
tr: Geçersiz giriş

source: Invalid user identifier
tr: Geçersiz kullanıcı kimliği

source: Invalid value
tr: Geçersiz değer

source: Email already exists
tr: E-posta zaten kayıtlı

source: Username already exists
tr: Kullanıcı adı zaten kayıtlı

source: Target user already has a cart
tr: Hedef kullanıcının zaten bir sepeti var

source: You do not have permission to create users
tr: Kullanıcı oluşturma izniniz yok

source: You do not have permission to list users
tr: Kullanıcı listeleme izniniz yok

source: You do not have permission to view or modify this user
tr: Bu kullanıcıyı görüntüleme veya düzenleme izniniz yok

source: You do not have permission to manage this user's addresses
tr: Bu kullanıcının adreslerini yönetme izniniz yok

source: You do not have permission to create carts for other users
tr: Diğer kullanıcılar için sepet oluşturma izniniz yok

source: You do not have permission to list carts
tr: Sepet listeleme izniniz yok

source: You do not have permission to manage categories
tr: Kategorileri yönetme izniniz yok

source: You do not have permission to manage products
tr: Ürünleri yönetme izniniz yok

source: You do not have permission to view this user's carts
tr: Bu kullanıcının sepetlerini görüntüleme izniniz yok

source: Staff and admin accounts cannot rate products for themselves
tr: Personel ve yönetici hesapları kendileri için ürün puanlayamaz

source: ratingId is required
tr: ratingId zorunludur

source: ratingId must be an integer
tr: ratingId tamsayı olmalıdır

source: userId must be an integer
tr: userId tamsayı olmalıdır

source: value must be between 0 and 5
tr: Değer 0 ile 5 arasında olmalıdır

source: bad
tr: hatalı

source: missing
tr: eksik

source: oops
tr: hata
